{"pageProps":{"id":"meditation","title":"Increasing your spontaneous introspective awareness reps","date":"2021-12-07T17:41:07.000Z","updated_at":"2021-12-07T18:50:58+01:00","content":"<p>If you don't do push ups - you definitely should do some, it has multiple benefits. Same with meditation.</p>\n<p>Here, I'm going to share with you two approaches to meditation, which made more sense to me than everything I have read before, including Headspace. In the web they are known as \"doing nothing\" and \"TMI (The mind illuminated)\".</p>\n<h2>Art of doing nothing</h2>\n<p>Recently YouTube algorithm recommended to me <a href=\"https://www.youtube.com/watch?v=3qHkcs3kG44\">podcast of Joe Rogan where he does interview with Raval Navikant</a>.</p>\n<p>There he shared interesting idea of the art of doing nothing.</p>\n<p>Modern people find it hard to just sit, and do nothing. Because it is the most boring thing to do. Sit and scroll Facebook - well, that is completely different. It makes even less sense to scroll Facebook, yet it is a lot more exciting for our brains. Because developers of apps spend a lot of effort to make our phones addictive.</p>\n<p>Raval says that modern humans have huge backlog of unresolved issues and thoughts you need to think over, and it constantly grows, since we constantly keep our brains occupied by external stimuli. So, our brain has no time to process that backlog.</p>\n<p>To achieve inner piece, according to Raval, you need to sit, close your eyes, and do nothing for an hour. Make no effort. If you think - think. If you don't - don't. Don't make effort to think, don't make effort to not thing, just sit and do nothing.</p>\n<p>And you need to do this every day, at least for an hour, because brain needs time to settle down and calm. And you need at least 60 days to process your backlog. And then you will have inner peace.</p>\n<p>Raval has a <a href=\"https://twitter.com/naval/status/1261481222359801856?lang=en\">series of tweets about this kind of meditation</a>.</p>\n<p>I tried this 3 times (for a whole hour). No any noticeable effects yet. Obviously because it probably needs a lot more time.</p>\n<p>Ah, and there is this thing with timers. When you use software timer, you have this anxiety: \"Will it ring after the time has passed? Or did it break, battery died or something? So I'll be sitting here in this meditation forever\" So instead I use mechanical kitchen timer I found in grocery store nearby. It ticks while it runs, so I know it still runs. And then it stops ticking and rings. And I could be confident that it runs, because I hear ticking, so I could return back to meditation with a calm mind.</p>\n<p>But I'll guess, I'll do it when I go to bed, and my wife wants to sleep, so she requests to turn lights off and I could not read. I'll probably fall asleep very quickly, but it's another benefit. If I'll not fall asleep - at least instead of having to worry that I'm could not fall asleep, I could just relax and allow brain to do some cleanup even without sleeping.</p>\n<h2>The mind illuminated</h2>\n<p>There is another approach to meditation, described in book called \"The mind illuminated\". It claims to be the modern interpretation of what Buddha and his followers were suggesting. There they describe multiple levels, where on each level you practice to master objectives of that level and move to another level. From establishing a practice, to achieving enlightenment.</p>\n<p>I'm still on level 1 - establishing a practice, so you need to take my words with a grain of salt, but I could tell you what I already learned from that book, and how it's different from what I did when I tried meditation before.</p>\n<p>Meditation is in a way similar to mental work. So, imagine you are writing an article about meditation, but then you need to do some research, like check if you correctly remember what Raval said on Joe Rogan podcast, go to YouTube, see another recommended video, and now you are falling into YouTube rabbit hole. That is not productive, and it's good if your brain reminds you that you should do something else in the current moment.</p>\n<p>So you yell at yourself \"go back to work, you lazy slacker!\", and switch back to work. In a bad mood. That makes work hard.</p>\n<p>You know what you are doing wrong? You training your brain to do wrong thing. Your brain noticed that your actions need corrections, and you punished it (yourself). Now, next time you will watch YouTube instead of working, your brain will not want to remind you about work not finished, because procrastinating feels good, and risking being punished feels bad.</p>\n<p>So, instead, when your brain notices, for example, that you should work instead of reading this post, you should smile, and tell your brain \"Good boy!\". It takes the same effort and time as being upset that you are not working, but now it trains brain that it good to remind you to focus at what you planned to do.</p>\n<p>And it has nothing to do with willpower, since willpower acts only on what your attention is pointing at. If your attention is somewhere else - it will not switch to something else, until some other entity in your brain that defines what from thousands of objects in your awareness deserves your attention, and switches it.</p>\n<p>Because your attention could process only one object at a time, or rapidly switch between 2 or 3 of them. But your perception, and awareness know that you are sitting in a chair, your butt feels the chair, your feet feel floor, you are looking at weird shapes on screen (letters of this article), screen has some dirt on it, there is wind outside, and leaves of trees make quiet sound, there is sound of car, and some kids playing. Bird sings. Inside your room clock ticks, and your computer probably makes noise too. You breathe, your chest expands and contracts, and air flows through your nose. Your heart beats. You feel itch on your head, and your hand raises to scratch it. There is always lot's of stuff happening that your brain knows about, so there is part of you, with more processing power than your conscience, that decides what filter out, and what show to attention. It's like a camera operator, that selects where to focus camera, to select what from frame all the scene would be shown on the screen.</p>\n<p>Your conscience could give that entity that selects objects for attention a request: \"I need my attention at work\", but it decides by itself, and it's better to be with it on good terms. So reward it, not punish, when it does what you asked for. In the book, that is called \"<em>Spontaneous introspective awareness</em>\". If you reward it, it will happen more often, and faster.</p>\n<p>In meditation according to \"The mind illuminated\", you sit, close your eyes to limit external stimuli, and focus your attention on breath. Or to be more precise - on the feeling of the air entering and leaving near the edge of your nostrils. When you notice your mind wandered and focused on thinking about something else  - <em>appreciate</em> that, and focus again. It's like training your muscles, but instead of doing push-ups, you do spontaneous introspective awareness reps.</p>\n<p>When it's get boring, and meditation is boring, you focus on feeling of boredom, thinking about how boring it is and suffer. Notice that, congratulate yourself for noticing, and focus on breathing again.</p>\n<p>You could feel like it's impossible to focus on breathing, because you are attacked by millions of thoughts. About meditation, about work, about family, about what happens outside, about everything. It's OK, your brain is always like this, you just noticing it now.</p>\n<p>Why you train meditation by focusing on breathing, not on writing code for example? Well, you could do both, but breathing has advantages:</p>\n<ol>\n<li>It's handy, because it's always with you. You could loose your phone, notebook, but once you lose your breath, you probably dead, or close to it. Ask somebody to  emergency number.</li>\n<li>It's very small object of meditation (actually it's broad, you have feeling in chest, diaphragm, sound of air in nostrils, feeling in nostrils, etc, but you could select to focus on something concrete of that). Unlike code, where every line is related to lot's of other lines.</li>\n<li>It's in happening present. When our brain is distracted, it's usually sends attention to past (which is gone, and could not be changed), or future (which is determined only by present). But only present moment exists. But attention is rarely tied to present moment. When you focus on breath, you learn to focus on something that is happening in present moment. You learn to be more present. With coding you often focus on the future (how this line I'm writing will be processed by compiler/interpreter), or past (oh yes, better avoid making this a pointer, pointers caused numerous bugs in the past), so it's easier to get distracted.</li>\n</ol>\n<p>Then there is advice to do it for some time, and in the morning, but in the end I think, it would be better to start just somehow. Forgot to meditate in the morning - try in the evening. Don't have time for 20 minutes - try at least for 5. 5 is better than 0.</p>\n<p>You could think: \"after this 5 minutes I don't notice any effects\". Don't think that, focus on your breath. Or work.</p>\n<p>If you are not yet ready to buy the book, and this post did not explained enough, you could also read <a href=\"https://codingmindfully.com/the-ultimate-guide-to-meditation-for-programmers/\">The Ultimate Guide to Meditation for Programmers</a>.</p>"},"__N_SSG":true}