{"pageProps":{"id":"write_more_but_shorter","title":"Write more but shorter","date":"2022-10-19T14:26:20.000Z","tags":["notes","on writing"],"updated_at":"2022-10-19T16:31:09+02:00","content":"<p>Some time ago I have read inspiring post \"<a href=\"https://critter.blog/2020/10/02/write-5x-more-but-write-5x-less/\">Write 5x more but write 5x less</a>\". I'll try to make it this blogs manifesto. It's not a promise, but it's a example I'll strive to. To summarize already short content, is this:</p>\n<ul>\n<li>You should write <strong>more often</strong></li>\n<li>What you write should be <strong>shorter</strong></li>\n</ul>\n<p>So I wanted to publish more stuff on my blog, but then ruzzia tried to occupy my country completely and that's messed up with a lot's of plans. I'm still stressed, there are still explosions and people dying, but ruzzia failed without doubts, so there are no excuses to continuing working, developing improving yourself and GDP of the free world.</p>\n<p>Here are reasons to write more:</p>\n<ul>\n<li>Thinking and writing is more productive than just thinking. It makes thinking more clear.</li>\n<li>More practice makes your skills better. You probably could see that I don't write much and is not very skilled. Writing skills is be especially useful in remote work, made mainstream by COVID.</li>\n<li>Writing more often makes it a habit. When you have writing habit, you wound not have to force yourself to write, it'll be natural.</li>\n<li>Writing is more shareable than speaking. You make more impact.</li>\n<li>Computers better store and search written knowledge.</li>\n<li>It frees space in your brain for new thoughts. That's I'm not so sure about, but article mentioned that.</li>\n</ul>\n<p>Why write shorter?</p>\n<ul>\n<li>Because the shorter it is, the more people will read it.</li>\n<li>Because of the <a href=\"https://en.wikipedia.org/wiki/Pareto_principle\">Pareto principle</a>: 80% of the value is in 20% of the length (hence “5x shorter”).</li>\n<li>Less work needed before publishing. Short iterations are good for software development, should be also good for writing.</li>\n</ul>\n<p>All this makes me think that school does something wrong when they tell you \"and it should be at least 10 pages, Times New Roman, 14 pt, 1.5 interval\". They should instead tell you that topic should be covered comprehensively, and in least number of words possible. But I guess everybody needs to relearn something that they not learned properly in school.</p>\n<p>Ah, and another note. Some time ago I enabled <a href=\"/posts/redesign_with_nextjs\">comments to be able to receive some feedback</a>. Since there was almost no feedback, I added Google Analytics to this blog. Turns out I have no readers, lol. One of the reasons is that half of the pages here are not indexed, and I don't know why, maybe because of last redesign broke a lot of URLs. Another probably is because I write not often, and too long. This post probably is already too long to be popular. :)</p>"},"__N_SSG":true}