{"pageProps":{"pageNumber":"1","posts":[{"id":"revision_checklist","title":"Revision checklist from Technical Writing One","date":"2021-01-28","tags":["notes","on writing"],"excerpt":"<p>Google has nice course on technical writing. It's text itself is example on how to apply advice you will learn there. I finished first part twice, because first time I just did exercises and not made any notes. Before starting second part I noticed that I forgot almost everything, so I retook it with also taking some notes.</p>\n<p>End of the course gives <a href=\"https://developers.google.com/tech-writing/one/summary\">short summary</a>, but here I'll give you mine checklist, which is a nice addition to <a href=\"/posts/edx_writing/#drafting-and-revision\">revision checklist from Academic and Business Writing</a>.</p>","content":"<p>Google has nice course on technical writing. It's text itself is example on how to apply advice you will learn there. I finished first part twice, because first time I just did exercises and not made any notes. Before starting second part I noticed that I forgot almost everything, so I retook it with also taking some notes.</p>\n<p>End of the course gives <a href=\"https://developers.google.com/tech-writing/one/summary\">short summary</a>, but here I'll give you mine checklist, which is a nice addition to <a href=\"/posts/edx_writing/#drafting-and-revision\">revision checklist from Academic and Business Writing</a>.</p>\n<ul>\n<li>Define your audience. What they know, what they need to learn?</li>\n<li>Define unfamiliar terms or link to their definition.</li>\n<li>Use acronyms only if you define it first, it appears often in document and is significantly shorter than full text.</li>\n<li>Make sure pronouns are unambiguous. Replace them (pronouns) with nouns when necessary.</li>\n<li>Active voice is better then passive.</li>\n<li>Avoid imprecise verbs - forms of \"be\", \"occur\", \"happen\". Remove \"there is\".</li>\n<li>Remove unnecessary words. Reduce wordiness.\n<ul>\n<li>Is able to -> can</li>\n<li>at this time -> now</li>\n</ul>\n</li>\n<li>Minimize adjectives and adverbs in educational texts.</li>\n<li>Avoid idioms.\n<ul>\n<li>piece of cake -> easy</li>\n</ul>\n</li>\n<li>Write short sentences. Each sentence should focus on single idea.</li>\n<li>Convert some long sentences to lists.</li>\n<li>Use bulleted lists for unordered items and numbered for ordered. If meaning of list changes from reordering - it should be numbered.</li>\n<li>Opening sentence of each paragraph should define what paragraph will be about.</li>\n<li>Each paragraph should be about separate topic.</li>\n<li>Each paragraph should answer 3 questions. (I am not very convinced about this).\n<ol>\n<li><em>What</em> you are telling your reader?</li>\n<li><em>Why</em> it is important?</li>\n<li><em>How</em> reader should use that knowledge? Or how should he know it is true?</li>\n</ol>\n</li>\n<li>Minimize use of parentheses. (They contain text that is not critical, so either text, or them could be removed.)</li>\n<li>Turn on spellchecking. (My addition).</li>\n</ul>\n<p>Vim users spellcheck like this:</p>\n<pre><code>:set spell spelllang=en_us\n</code></pre>\n<p><code>]s</code> moves you to next misspelled word. <code>[s</code> - to previous. <code>z=</code> gives you a list of suggestions.</p>"},{"id":"evergreen_notes","title":"Evergreen notes","date":"2021-01-27","tags":["notes","on writing"],"excerpt":"<p>Here are my notes of <a href=\"https://notes.andymatuschak.org/Evergreen_notes\">the notes about \"evergreen notes\"</a>. I find concept interesting, as it reminds me of how I already tried to do knowledge management in the past, while editing Wikipedia, or keeping notes for myself.</p>\n<p><strong>Evergreen notes</strong> are notes made across projects which are expected to evolve and accumulate. \"Evergreen\" here means functional, live &#x26; useful for a long time.</p>","content":"<p>Here are my notes of <a href=\"https://notes.andymatuschak.org/Evergreen_notes\">the notes about \"evergreen notes\"</a>. I find concept interesting, as it reminds me of how I already tried to do knowledge management in the past, while editing Wikipedia, or keeping notes for myself.</p>\n<p><strong>Evergreen notes</strong> are notes made across projects which are expected to evolve and accumulate. \"Evergreen\" here means functional, live &#x26; useful for a long time.</p>\n<p>Andy Matushak invented the term \"evergreen notes\". He argues that most people write only transient (temporary) notes. Transient notes usually serve only as aid to working memory. Some people try to improve efficiency of transient note taking. This is not very effective, because they focus on improving the tool of note taking, while improvement effort should be focused on better thinking. And transient notes lack useful feedback, so people often plateau in their writing skills.</p>\n<p>Evergreen notes are derived from Zettelkasten (note boxes) system, created by Niklas Luhmann. He was a very productive sociologist, who, with the help of his system, published about 70 books. Andy adds, that unlike other people who write articles about note-taking, he actually achieved something in other fields using his tool, while main job of note-taking article authors is writing about note taking &#x26; other life hacks.</p>\n<h2>Principles</h2>\n<p>Evergreen notes are built on following principles:</p>\n<ul>\n<li>They are <strong>atomic</strong>. Each note is about one thing, but comprehensive. Think about them as software modules, keeping in mind coupling and cohesion.</li>\n<li>They are <strong>concept-oriented</strong>. You don't write evergreen note about one book or author, you write it about one idea, and when you read another book on topic - add to existing note.</li>\n<li>They are <strong>densely linked</strong>. When you write about idea - think about how it relates to other ideas. Building links will make you reread existing notes, which in turn will work as a form of spaced repetition. Links not necessary have to be made to existing notes, they could serve as a writing backlog for the future.</li>\n<li><strong>Associative ontologies</strong> (graphs) are better than hierarchical taxonomies (trees). Structure of notes should emerge organically, and not be enforced in advance. Tags are ineffective in organizing knowledge, because they do not add weight (measure of how much something belongs to a tag) to association. Labeled associations are better: why is this associated with that?</li>\n</ul>\n<h2>Process</h2>\n<p><strong>Write about what you read</strong>. This will increase your understanding of topic, and you will forget less. Also, if you write about what you read, you will not just repeat someones neural process, but process it yourself and may be have another conclusions. Process of writing about reading has two steps:</p>\n<ol>\n<li>Write annotations &#x26; observations while you read. Bookmark some pages, write down quotes.</li>\n<li>Process list of annotations into evergreen notes for each concept.</li>\n</ol>\n<p>Maintain <strong>reading backlog</strong> - anything you will read soon. If you are not reading something for a long time - remove it from reading backlog (but you could keep a reference to it in some evergreen note).</p>\n<p>Maintain <strong>writing backlog</strong>. Regularly go over your transient notes and discard unimportant, or add important stuff to evergreen notes. Finish unfinished evergreen notes.</p>\n<p>When you need to write about some topic, starting with evergreen notes will be easier then starting from the blank page:</p>\n<ol>\n<li>Review notes related to topic and probably also related to them. Reviewing notes could cause some interesting new ideas.</li>\n<li>Write outline.</li>\n<li>Attach existing notes to outline, add missing notes.</li>\n<li>Concatenate whole text.</li>\n<li>Rewrite.</li>\n</ol>\n<h2>My ramblings on possible implementations</h2>\n<p>Andy Matushak uses his own proprietary software for his system. I think it would be not hard to implement with just any tool that could process markdown. But of course any tool that will help with adding links, indexing and tracking backlinks would be useful.</p>\n<p>Maybe it could be done in TiddlyWiki and I should give it another try. I used it to aid me with onboarding into my current job, and it was not bad, if you don't count that it uses markup language different from markdown and MediaWiki, and I found it hard to compile some publishable documentation for intranet from it.</p>\n<p>Or maybe it could be small program that maps folder with markdown files into set of HTML pages with computed backlinks &#x26; index. Maybe that program would also have an interface to edit markdown and see result in split view, and also update markdown file on server? Or something like MediaWiki? Maybe something simpler than MediaWiki, as it requires lots of infrastructure.</p>\n<p>I also have this idea of an application that stores notes on an infinite 2d plane. Something like digital <a href=\"http://en.wikipedia.org/wiki/Evidence_board\">evidence board</a> in style of <a href=\"https://en.wikipedia.org/wiki/Fsn_(file_manager)\">fsn file manager</a>. Notes have coordinates, width and height. (Maybe also rotation?) And style (background, border...) Notes also could be bitmap or vector images or SVGs. You could add links between notes, and reposition notes using some force-directed graph drawing algorithm. And have infinite level of zoom, where smaller notes are displayed only when you zoom in, and disappear when you zoom out. I imagine that this maybe could be used not only for concept mapping, but for working with code, where you have functions call other functions, and they are organized into classes, modules, packages etc... So when you have architecture of some system of the screen where you see relations between microservices, you zoom in and see packages of microservice, zoom in again - see classes &#x26; functions, zoom in again - see implementation of method on the screen.</p>\n<p>But for now I just have a blog. Hugo maps markdown into HTML for me, but blog enforces chronological structure. Removing dates from notes will not help, because in blog notes are published, or not published, they are not evergreen.</p>\n<p>How do you, dear reader, store your thoughts and work on your notes?</p>"},{"id":"edx_writing","title":"Academic and Business Writing course notes","date":"2021-01-01","toc":true,"tags":["MOOC","notes","on writing"],"excerpt":"<p>This post will contain my notes and assignments from the edX course <a href=\"https://courses.edx.org/courses/course-v1:BerkeleyX+ColWri2.2x+1T2020/course/\">Academic and Business Writing</a>.</p>\n<p>I would rearrange notes in order that seems more logical for the writing process, not in the order information was provided in course.</p>\n<p>In general writing process could be organized in following steps:</p>\n<ol>\n<li>Reading. To be a good writer you need to be active reader.</li>\n<li>Prewriting. All the stuff you do before you get down to actual writing.</li>\n<li>Writing draft, trying to use correct vocabulary.</li>\n<li>Revision of that draft to produce next draft with fixed writing problems.</li>\n<li>Repeating step 4 again for more low-level improvements of text (editing).</li>\n</ol>\n<p>This steps and ways to get better at them will be detailed in sections below.</p>","content":"<p>This post will contain my notes and assignments from the edX course <a href=\"https://courses.edx.org/courses/course-v1:BerkeleyX+ColWri2.2x+1T2020/course/\">Academic and Business Writing</a>.</p>\n<p>I would rearrange notes in order that seems more logical for the writing process, not in the order information was provided in course.</p>\n<p>In general writing process could be organized in following steps:</p>\n<ol>\n<li>Reading. To be a good writer you need to be active reader.</li>\n<li>Prewriting. All the stuff you do before you get down to actual writing.</li>\n<li>Writing draft, trying to use correct vocabulary.</li>\n<li>Revision of that draft to produce next draft with fixed writing problems.</li>\n<li>Repeating step 4 again for more low-level improvements of text (editing).</li>\n</ol>\n<p>This steps and ways to get better at them will be detailed in sections below.</p>\n<h2>Reading</h2>\n<p><strong>Interrogate</strong> - to question closely, aggressively and formally.</p>\n<p><strong>Interrogate text</strong> - to read it critically, writing down questions. What that means? Why author came to that conclusion?...</p>\n<p>To really understand text, write down it's ideas in your own words.</p>\n<p>Make outline of text.</p>\n<p>Write summary after finishing chapter or document. What were main ideas there?</p>\n<p>Analyze. What is the evidence provided? Is logic correct?</p>\n<p>Compare and contrast with other texts. Does it agree or disagree?</p>\n<p>Reading is actually a conversation with an author.</p>\n<p><strong>Annotating</strong> is almost synonymous with taking notes, but refers to making notes directly in text - underlining/highlighting, writing on margins... You could use post-its to add annotations in book you don't want to damage.</p>\n<p>As an exercise for this chapter it was advised to write notes for the article <a href=\"https://www.nytimes.com/2011/03/06/magazine/06Riff-t.html\">What I Really Want Is Someone Rolling Around in the Text</a>. Here are <a href=\"#taking-notes\">my notes</a>.</p>\n<h2>Prewriting (informal planning)</h2>\n<p>Will improve writing quality and save your time on revisiting and rewriting.</p>\n<p>Common activities include:</p>\n<ul>\n<li>idea maps</li>\n<li>outlines</li>\n<li>freewriting</li>\n</ul>\n<p>But also following, we will look in more details:</p>\n<h3>Cubing</h3>\n<p>Look at your topic from 6 points of view (sides of cube):</p>\n<ol>\n<li><strong>Describe</strong> topic. Its shape, size, color, sound... Use all your senses.</li>\n<li><strong>Compare</strong> to related topics. How is it different or similar?</li>\n<li><strong>Associate</strong>. What does it make you think about?</li>\n<li><strong>Analyze</strong> its parts. How they connect? Have they equal or different importance?</li>\n<li><strong>Apply</strong>. What could be done with it? What's the use</li>\n<li><strong>Argue</strong> for and against the topic. How could someone disagree with it?</li>\n</ol>\n<h3>The matrix</h3>\n<p>Multi-point comparison of parts of topic with questions or points.</p>\n<p><em>This basically was just formatting facts about your topic in a table. Not sure it will work with all topics, or I did not got it correctly</em></p>\n<h3>Interviewing topic</h3>\n<p>Imagine topic is a person and ask it questions:</p>\n<ol>\n<li>Your full name? Does someone know you by different name?</li>\n<li>How does dictionary or encyclopedia define you?</li>\n<li>Where, how and when you are born?</li>\n<li>Are you still alive? How you died?</li>\n<li>To what group do you belong? Who are others in your group?</li>\n<li>Can you be divided in parts? How?</li>\n<li>Were you different in the past? Will you change in the future?</li>\n<li>What's your purpose?</li>\n<li>What is similar or different from you?</li>\n<li>What are some interesting facts or statistics about you?</li>\n<li>Who could I talk to about you? Are there any experts?</li>\n<li>Quotes about you?</li>\n<li>News stories about you?\n...</li>\n</ol>\n<h2>Drafting and revision</h2>\n<p>Creating a draft:</p>\n<ol>\n<li>Write outline</li>\n<li>Write introduction</li>\n<li>Write paragraphs</li>\n<li>Write conclusion</li>\n</ol>\n<p>After the first draft comes revision(s). You don't focus on grammar and spelling at first, first you reorganize sections, delete unnecessary, add missing, provide additional examples, add clarity to arguments, etc...</p>\n<p>Revision checklist:</p>\n<ol>\n<li>Is title interesting and descriptive?</li>\n<li>Does opening catches attention?</li>\n<li>Will your readers learn something interesting?</li>\n<li>Is it organized logically?</li>\n<li>Do you support your ideas with examples?</li>\n<li>Is there unnecessary information to remove?</li>\n<li>Are transitions from one idea to next effective?</li>\n<li>Is conclusion satisfying and leaves the reader with a food for thought?</li>\n<li>Tone and diction</li>\n<li>Vocabulary</li>\n<li>Punctuation</li>\n<li>Grammar</li>\n</ol>\n<p>Some tricks to catch errors:</p>\n<ul>\n<li>Read the text backwards</li>\n<li>Read it aloud</li>\n<li>Listen to it using text to speech software.</li>\n</ul>\n<p>Fixing vocabulary, grammar and spelling is called <strong>editing</strong>.</p>\n<p><strong>Revision</strong> is more about semantics than syntax.</p>\n<h2>Writing problems</h2>\n<h3>Grammar</h3>\n<p>Only grammar is not enough to be a good writer, but poor grammar will distract reader from your writing.</p>\n<p>Priorities in grammar:</p>\n<ol>\n<li>Correct vocabulary</li>\n<li>Verb tenses</li>\n<li>Subject-verb agreement</li>\n<li>Plural vs singular.</li>\n</ol>\n<p>Less critical (people should still understand you):</p>\n<ul>\n<li>prepositions</li>\n<li>articles</li>\n</ul>\n<p><em>What is your biggest grammar problem and how to improve it?</em></p>\n<p>I'm not sure yet, as I rarely get feedback on it, except one from the spellchecker. Probably articles and tenses. If you are reading this, could you please give me a comment which explains my biggest grammar problem?</p>\n<h3>Wordiness</h3>\n<p>Reasons for excessive wordiness:</p>\n<ul>\n<li>Trying to sound too formal</li>\n<li>Not knowing more precise vocabulary</li>\n<li>Unnecessary and vague modifiers. Remove words like very, quite, really, etc...</li>\n<li>Use active voice instead of passive</li>\n<li>Remove personal commentary: I believe, I just want to say...</li>\n</ul>\n<h3>Spelling</h3>\n<p>To know how to spell properly is useful even with spellcheckers everywhere. First, spellcheckers don't catch all errors, if misspelled word looks as correctly spelled different word. Second, there are no spellcheckers in handwriting...</p>\n<p>Ways to practice spelling:</p>\n<ul>\n<li>Word games: Scrabble, words with friends...</li>\n<li>Dictation. Also helps with the listening comprehension. You just need to have some correctly written text read aloud slowly enough by someone, type it  into text file, then compare with correct version using diff program like meld (or just regular diff). I just don't know where to find such texts. Audio books would have been nice, but how to reduce their speed and still make them pleasant to listen? Maybe there is some audio player that could make a pause at the end of each sentence said?</li>\n</ul>\n<p>Fun fact: English spelling is hard because it uses alphabet for another language - Latin, which sounded differently.</p>\n<h2>Diction</h2>\n<p><strong>Diction</strong> - the words you chose to express meaning. Your choice should depend on kind of writing you do, and style you selected.</p>\n<p>In English formal words tend to be longer and derive from Latin, while informal - shorter and stem from Anglo-Saxon.</p>\n<p>Common diction errors:</p>\n<ul>\n<li>Among/between Between involves 2 objects, among > 2</li>\n<li>Everyday/Every day. Everyday - adjective = typical. Every day - when something happens.</li>\n<li>Mom,dad/mother,father - formal and informal forms.</li>\n<li>You guys - informal. All of you - formal.</li>\n<li>Infer/imply. Infer is act of thinking. Imply - meaning of something said.</li>\n<li>It's/its. It's - it is. Its - possessive</li>\n</ul>\n<p><strong>Connotation</strong> - idea or feeling that word holds in addition to main meaning (<em>denotation</em>). For example person that is saving money could be cheap, frugal, miserly or economical. Cheap and miserly have negative connotation. Frugal and economical - positive.</p>\n<p><strong>Tone</strong> - emotion of writing: happy, sad, threatening, optimistic. Tone is important as it allows to know authors attitude to the topic.</p>\n<h3>8 ways to develop vocabulary</h3>\n<ol>\n<li>Learn words in categories - kitchen (pot, bowl, ...), bedroom (blanket, pillow, ...)</li>\n<li>Journal. Write down all words that seem important, later use them in sentences.</li>\n<li>Learn collocations (words that often appear together). There are collocation dictionaries online.</li>\n<li>Use mnemonics (like the ones on Memrise)</li>\n<li>Immediately use the word. Write it, speak it.</li>\n<li>Learn area specific vocabulary, use mindmaps to do it.</li>\n<li>Observation journal. Name everything you see. If you didn't know the word - write down in your native language, then lookup.</li>\n<li>Spaced repetition.</li>\n</ol>\n<h2>Homeworks</h2>\n<p>I did not done all the homeworks (as I did not submitted them). I thought that working on writing notes to this course would be enough practice.</p>\n<h3>Taking notes</h3>\n<p><strong>What I Really Want Is Someone Rolling Around in the Text</strong> by <em>Sam Anderson</em></p>\n<p>Author found a book \"How to read a Book\". It seemed old and boring to him, but he remembered only one idea: \"You don't really own a book until you marked it\".</p>\n<p>He quickly adopted a habit of marginalia - making notes on margins, underlying important parts, marking keywords, writing down numbers of important pages at the end. It is common practice of effective study, but for him it felt like a way to more actively interact with text.</p>\n<p>His habit developed to more intense and complex. He has long list of different figures for markings, and it seems like addition. He rarely reads without writing instrument in hand.</p>\n<p>With e-books it is not as easy to make notes on the margins.</p>\n<p>Golden age of marginalia was in 1700-1850. Back then people used books like we now use social networks - to comment on ideas and share with each other. Common gift was an annotated book. There was a person, Samuel Taylor Coleridge, whose friends begged him to annotate his books, later he published his own \"marginalia\" and invented the word \"marginalia\".</p>\n<p>Marginalia could be a bridge between modern internet social networks and literature.</p>\n<p>A friend of author borrowed from him a book, but he needed it so took it back before she finished it. She had to use clean one. After finishing she told that she felt lonely reading unannotated version.</p>\n<p>He imagines putting his notes on transparent margin-sized plastic strips, so he could share them with friends, and receive notes from friends instead. Than he understood that this idea is more easier to implement using modern digital tech.</p>\n<p>Author of blog Book Two argues that the only meaningful thing we could own with digital books is the reading process itself. Because digital books lack this meta-information of bended pages, marks on margins, etc.</p>\n<p>Amazon launched comment sharing on Kindle, between friends. But it would be nice also to be able to access notes some famous authors made on their books.</p>\n<p>Some people don't like marginalia. In digital variant it would be easy to turn it off.</p>\n<p>Such thing could be a Gutenberg-level revolution.</p>\n<p>He once published his marginalia in a magazine, under title \"A year in marginalia\" (for the year of reading). Feedback was positive.</p>\n<p>It seems natural in age of Web 2.0. YouTubers now do reviews of TV Shows, which is analogous to marginalia.</p>\n<p>Criticism now is very high level and thinks about big picture. Author wants \"someone rolling around in test\", more detailed, and more related to reading.</p>\n<p><strong>What was the main idea of the article?</strong>\nMain idea is that writing and reading notes on the margins of the book is fun and useful activity, and it should be more popular, especially with e-books.</p>\n<p><strong>What was your opinion of the article?</strong>\nInteresting article, gives idea about a new software projects, and also to try new way of reading.</p>\n<p><strong>Was there any part of the article you disagreed with?</strong>\nFirst, it will most likely not be Gutenberg-level revolution. If it were - there were already signs of it. Marginalia is not so popular as passive reading (from what I observed).</p>\n<p>Maybe it is possible, but it as hard to design, as to design modern web, for example. Web is built on simple ideas - you have resources, identified by URL, and they could link to each other.</p>\n<h3>About writing</h3>\n<blockquote>\n<p>Write about the type of writing you do. What do you think about writing? Do you enjoy it? What area of writing do you need to improve most?</p>\n</blockquote>\n<p>I did a lot of writing in Ukrainian before. I have a blog about programming and life in general, but I'm not sure if my writing there is good enough, as I don't get a lot of feedback. Well, probably that means that it was not so good, because I did not became as Dorje Batuu. And that guy is obviously great writer. He writes about his work at NASA in a very interesting way. So, I have a lot of room to improve.</p>\n<p>I enjoy writing, but also struggle with it. At my work, we regularly do performance evaluations, and it turns out there bottleneck is no longer my programming ability, but my communication ability. Given that English is not my native language, and at work I write about what I have to write, not about what I want to write, from there I have my struggles. Not that I don't want to write what I'm required to at my work, but I just could not get so passionate about Jira ticket or documentation, as I could be about making some blog post.</p>\n<p>From feedback at my job I understood that I need most improvement in making my writing clear. We don't have any native English speakers there, to cringe over my spelling and grammar, but often I need to rephrase and repeat something that I have written to make people understand.</p>\n<h3>Movie review in different styles</h3>\n<ol>\n<li>Write a formal and objective review of film, 150-250 words.</li>\n<li>Make same review humorous and informal.</li>\n<li>Make it sad and pessimistic.</li>\n</ol>\n<p>\"Good Bye, Lenin!\" is a German comedy-drama movie, events of which happen in Berlin. It is a story of a family divided by the wall, and their reaction to the fall of the wall. Mother of the family who strongly believes into the values of DDR, has accident and falls into a coma. She spends months in hospital without consciousness, and when she wakes up, the wall is gone. Her son tries to hide that fact from her, because that would make her worry to much, and could lead to another accident. His efforts are the source of the humor of this film. All the rest is the drama about how the family tries to live through the time of changes. It is also educational, as it lets viewer to learn the facts about period in German history, and explains German ostalgie (nostalgie for the old times of DDR), without criticizing or mocking it. It features the music of Yann Tiersen, which fits it very much, as it makes you to have fun and in the same time make you sad and nostalgic.</p>\n<p>My wife thinks that we moved to Berlin because I wanted to better immerse myself into the cinematic universe of \"Good Bye, Lenin!\". That could partially be true, as this is one of my favorite movies, I rewatched more, then I have seen main character wake up in the Groundhog Day. So when I walk through the Karl-Marx Allee I think: \"Oh, probably here they lived!\". This feature everything Berlin is - world-famous healthcare in Charite, night clubs in weird facilities, picking up free trash stuff from the street, dumping your trash on the street, IKEA furniture and soft drinks as an vanguard of capitalist conquest of the socialistic city that is ongoing till today. Plot of the film is described by it's title, and if you don't know who or what Lenin is - it is symbol for socialism, the wall and all the bad and good stuff that comes with it. But the main hero, Alex, don't want his mother to know that it's time to say to the wall \"Good bye\". So Alex goes for help to his friend, Denis, who is big fan of the film \"The Matrix\" inferring from his T-Shirt. Together they create their own rea-life version of the Matrix, and put Alex's mother in there. Will she break from the Matrix? I won't tell you to not spoil the film. Watch it for yourself, it is worth the time.</p>\n<p>I'll pass third part of assignment, as I spent a lot of time on it already, and nothing just comes to my mind.</p>"}],"pages":1,"archives":[{"url":"/month/2018-12/page/1","id":"2018-12","count":1,"title":"2018-12"},{"url":"/month/2020-06/page/1","id":"2020-06","count":7,"title":"2020-06"},{"url":"/month/2020-07/page/1","id":"2020-07","count":10,"title":"2020-07"},{"url":"/month/2020-08/page/1","id":"2020-08","count":2,"title":"2020-08"},{"url":"/month/2020-09/page/1","id":"2020-09","count":2,"title":"2020-09"},{"url":"/month/2020-12/page/1","id":"2020-12","count":1,"title":"2020-12"},{"url":"/month/2021-01/page/1","id":"2021-01","count":4,"title":"2021-01"}],"topics":[{"url":"/tag/MOOC/page/1","id":"MOOC","title":"MOOC","count":2},{"url":"/tag/SICP/page/1","id":"SICP","title":"SICP","count":20},{"url":"/tag/ideas/page/1","id":"ideas","title":"ideas","count":1},{"url":"/tag/notes/page/1","id":"notes","title":"notes","count":5},{"url":"/tag/on writing/page/1","id":"on writing","title":"on writing","count":3}],"tag":"on writing"},"__N_SSG":true}