{"pageProps":{"id":"redesign_with_nextjs","title":"I redesigned my blog, again","date":"2021-11-28","content":"<p>Maybe you noticed the redesign. But most probably you did not, because you are first time here. It's normal, blogs are in decline probably since Google closed it's Reader service. Which was probably not a cause but symptom of that decline. And I do not even have RSS/Atom here (yet?).</p>\n<p>Anyway, my site here changed designs very often. First it was self-made static site generator in python that resolved JS dependencies. Then I added bootstrap. Then removed bootstrap. Then I got rid of my own generator and used Hugo. It looked like this:</p>\n<p><img src=\"/content/HugoTheme.png\" alt=\"Old design with Hugo\" title=\"Old design with Hugo\"></p>\n<p>I used it for couple of years, but did not like it for this reasons:</p>\n<ul>\n<li>I could not just add a file to posts folder, and expect post to appear, I need to use some Hugo command that creates it, with front-matter and other stuff.</li>\n<li>After post is created as a draft, I'm not sure how to change it's publication date. Just changing date in front-matter does not work. Some of my posts stay in draft phase for years (at least on Wordpress blog, here a little bit less, since even drafts could be regarded as published, if you push blog source files to GitHub.)</li>\n<li>Working with JS in Hugo and it's templates (go templates), is not much pleasure.</li>\n<li>Hugo is described as \" The world’s fastest framework for building websites\", but I don't care much about that yet. Maybe I'll care after I have a 1000 posts, but currently I don't mind waiting a couple of seconds.</li>\n</ul>\n<p>But most important reason to switch was that I wanted to try to write something in React, and make this blog more dynamic.</p>\n<p>So I took the content of my blog as it was, markdown files with YAML front-matter. Then wrote some JS functions that load and query that files and transform markdown into HTML, and used that data as arguments to react components that build my blog. I also used Material UI components. It looked like this:</p>\n<p><img src=\"/content/MaterialUIBlog.png\" alt=\"Old design with MaterialUI\" title=\"Old design with MaterialUI\"></p>\n<p>Then, I saw my blog on various devices, and noticed that since I have not a lot of skills in UI, my blog is not as responsive as I wanted it to be. And then, I thought, that given amount of content I have there is no much utility from tags or monthly archives, and got rid of them. Than it looked like Material UI is overkill for what was left there. So, I took inspiration from http://bettermotherfuckingwebsite.com/, and implemented my own theme in a under 30 lines of unminified CSS:</p>\n<pre><code class=\"hljs language-css\"><span class=\"hljs-selector-tag\">body</span> {\n\t<span class=\"hljs-attribute\">font-family</span>: <span class=\"hljs-string\">'Helvetica'</span>, <span class=\"hljs-string\">'Arial'</span>, sans-serif;\n\t<span class=\"hljs-attribute\">font-size</span>:<span class=\"hljs-number\">16px</span>;\n\t<span class=\"hljs-attribute\">color</span>:<span class=\"hljs-number\">#24292f</span>;\n\t<span class=\"hljs-attribute\">margin</span>:<span class=\"hljs-number\">40px</span> auto;\n\t<span class=\"hljs-attribute\">padding</span>:<span class=\"hljs-number\">0</span> <span class=\"hljs-number\">10px</span>;\n\t<span class=\"hljs-attribute\">line-height</span>: <span class=\"hljs-number\">1.5</span>;\n\t<span class=\"hljs-attribute\">max-width</span>:<span class=\"hljs-number\">830px</span>;\n}\n\n<span class=\"hljs-selector-tag\">h1</span>,<span class=\"hljs-selector-tag\">h2</span>,<span class=\"hljs-selector-tag\">h3</span> {\n\t<span class=\"hljs-attribute\">line-height</span>:<span class=\"hljs-number\">1.25</span>;\n\t<span class=\"hljs-attribute\">border-bottom</span>:<span class=\"hljs-number\">1px</span> solid <span class=\"hljs-number\">#eee</span>;\n}\n\n<span class=\"hljs-selector-tag\">footer</span> {\n\t<span class=\"hljs-attribute\">margin-top</span>: <span class=\"hljs-number\">1em</span>;\n\t<span class=\"hljs-attribute\">padding-top</span>: <span class=\"hljs-number\">0.5em</span>;\n\t<span class=\"hljs-attribute\">border-top</span>: <span class=\"hljs-number\">1px</span> solid <span class=\"hljs-number\">#eee</span>;\n}\n\n<span class=\"hljs-selector-tag\">nav</span> <span class=\"hljs-selector-tag\">a</span> {\n\t<span class=\"hljs-attribute\">margin-right</span>: <span class=\"hljs-number\">1em</span>;\n}\n\n<span class=\"hljs-selector-tag\">img</span> {\n\t<span class=\"hljs-attribute\">width</span>: <span class=\"hljs-number\">100%</span>;\n\t<span class=\"hljs-attribute\">border</span>: <span class=\"hljs-number\">2px</span> outset <span class=\"hljs-number\">#eee</span>;\n}</code></pre>\n<p>And navigation here is could not be more simpler. You have <a href=\"/\">home page</a> that links to every post. Every post links back to it. Period.</p>\n<p>Now the missing features are comments, analytics and RSS. And fix rendering of LaTeX.</p>\n<p>Comments are probably most important, because otherwise I'll not be able to receive feedback. And without anyone telling me that I'm writing some bullshit - how would I improve my writing? I'm thinking to maybe build something using Google docs (<a href=\"https://jdvp.me/articles/Google-Forms-Jekyll-Comments-Revisited\">Article about implementing comments for Jekyll blog using Google Forms</a>), but that will take more time. Maybe I'll enable Disqus again. It has downsides, but a lot of sites use it and not complain.</p>"},"__N_SSG":true}